## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/aa048d7c-2fe3-43c3-8be2-53c1a8ec70a6/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appconfig.azurerm_app_configuration.appconfig will be created
  + resource "azurerm_app_configuration" "appconfig" {
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + local_auth_enabled         = true
      + location                   = "australiaeast"
      + name                       = "appconfig-biotrackr-prod-ae"
      + primary_read_key           = (known after apply)
      + primary_write_key          = (known after apply)
      + purge_protection_enabled   = false
      + resource_group_name        = "rg-biotrackr-prod-ae"
      + secondary_read_key         = (known after apply)
      + secondary_write_key        = (known after apply)
      + sku                        = "free"
      + soft_delete_retention_days = 7
      + tags                       = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.appconfig_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.appconfig.azurerm_app_configuration.appconfig will be created%0A  + resource "azurerm_app_configuration" "appconfig" {%0A      + endpoint                   = (known after apply)%0A      + id                         = (known after apply)%0A      + local_auth_enabled         = true%0A      + location                   = "australiaeast"%0A      + name                       = "appconfig-biotrackr-prod-ae"%0A      + primary_read_key           = (known after apply)%0A      + primary_write_key          = (known after apply)%0A      + purge_protection_enabled   = false%0A      + resource_group_name        = "rg-biotrackr-prod-ae"%0A      + secondary_read_key         = (known after apply)%0A      + secondary_write_key        = (known after apply)%0A      + sku                        = "free"%0A      + soft_delete_retention_days = 7%0A      + tags                       = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A    }%0A%0A  # module.appconfig_data_reader_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "App Configuration Data Reader"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>